test/integration/helpers/fixtures/offline-payment-update.json

[
    {
        "scope": "https://api.trolley.com:443",
        "method": "POST",
        "path": "/v1/recipients",
        "body": {
            "type": "individual",
            "firstName": "Tom",
            "lastName": "Jones",
            "email": "testEmail@example.com",
            "address": {
                "street1": "123 Wolfstrasse",
                "city": "Berlin",
                "country": "DE",
                "postalCode": "123123"
            }
        },
        "status": 200,
        "response": {
            "ok": true,
            "recipient": {
                "id": "R-DPo9qWkicF6AMJF1SNv4J5",
                "referenceId": "R-DPo9qWkicF6AMJF1SNv4J5",
                "parentRecipientId": null,
                "email": "testEmail@example.com",
                "name": "Tom Jones",
                "lastName": "Jones",
                "firstName": "Tom",
                "legalName": "",
                "type": "individual",
                "status": "incomplete",
                "language": "en",
                "complianceStatus": "pending",
                "dob": null,
                "passport": "",
                "placeOfBirth": null,
                "updatedAt": "2023-03-02T01:45:05.851Z",
                "createdAt": "2023-03-02T01:45:05.851Z",
                "tags": [],
                "isPortalUser": false,
                "taxDeliveryType": "mail",
                "contactEmails": [],
                "occupation": "",
                "address": {
                    "street1": "123 Wolfstrasse",
                    "street2": "",
                    "city": "Berlin",
                    "postalCode": "123123",
                    "country": "DE",
                    "region": null,
                    "phone": "",
                    "phoneValidated": false
                },
                "compliance": {
                    "status": "pending",
                    "checkedAt": null
                },
                "gravatarUrl": "https://www.gravatar.com/avatar/47891e3b30e9fe3c5355801d4cbd5896?d=404",
                "governmentId": null,
                "ssn": null,
                "governmentIds": [],
                "birthplace": {
                    "country": null,
                    "region": null,
                    "city": null
                },
                "citizenships": [],
                "routeType": "sepa",
                "routeMinimum": "0",
                "estimatedFees": "4",
                "accounts": [],
                "payoutMethod": null,
                "primaryCurrency": null,
                "riskScore": null,
                "merchantId": "M-EZ6uVwg9vSUrG6vJNjR9KA",
                "inactiveReasons": {
                    "primaryAccount": "missing"
                },
                "taxWithholdingPercentage": null,
                "taxForm": null,
                "taxFormStatus": null
            }
        },
        "rawHeaders": [
            "Date",
            "Thu, 02 Mar 2023 01:45:05 GMT",
            "Content-Type",
            "application/json; charset=utf-8",
            "Content-Length",
            "1626",
            "Connection",
            "close",
            "Cache-Control",
            "no-store, no-cache",
            "Content-Security-Policy",
            "default-src 'self';base-uri 'self';block-all-mixed-content;font-src 'self' https: data:;frame-ancestors 'self';img-src 'self' data:;object-src 'none';script-src 'self';script-src-attr 'none';style-src 'self' https: 'unsafe-inline';upgrade-insecure-requests",
            "X-DNS-Prefetch-Control",
            "off",
            "Expect-CT",
            "max-age=0",
            "Strict-Transport-Security",
            "max-age=15552000; includeSubDomains",
            "X-Download-Options",
            "noopen",
            "X-Content-Type-Options",
            "nosniff",
            "X-Permitted-Cross-Domain-Policies",
            "none",
            "Referrer-Policy",
            "no-referrer",
            "X-XSS-Protection",
            "0",
            "Access-Control-Allow-Origin",
            "*",
            "X-Rate-Limit-Limit",
            "75",
            "X-Rate-Limit-Remaining",
            "74",
            "X-Rate-Limit-Reset",
            "1677721565",
            "Vary",
            "Origin",
            "ETag",
            "W/\"65a-PGkQboyGpFwZt6ZyM05xtpsNFGU\""
        ],
        "responseIsBinary": false
    },
    {
        "scope": "https://api.trolley.com:443",
        "method": "POST",
        "path": "/v1/recipients/R-DPo9qWkicF6AMJF1SNv4J5/offlinePayments",
        "body": {
            "externalId": "testOfflinePayment",
            "taxReportable": false,
            "amount": "10.00",
            "currency": "USD",
            "withholdingAmount": "2.40",
            "withholdingCurrency": "USD"
        },
        "status": 200,
        "response": {
            "ok": true,
            "offlinePayment": {
                "id": "OP-UqKJ3sPjSDipGKKHM79EcU",
                "recipientId": "R-DPo9qWkicF6AMJF1SNv4J5",
                "taxFormId": null,
                "entered": {
                    "value": "10.00",
                    "currency": "USD"
                },
                "withholding": {
                    "value": "2.40",
                    "currency": "USD"
                },
                "equivalentWithholding": {
                    "value": "2.40",
                    "currency": "USD"
                },
                "amount": "10.00",
                "currency": "USD",
                "withholdingAmount": "2.40",
                "withholdingCurrency": "USD",
                "equivalentWithholdingAmount": "2.40",
                "equivalentWithholdingCurrency": "USD",
                "paymentId": null,
                "externalId": "testOfflinePayment",
                "memo": "",
                "payoutMethod": null,
                "tags": [],
                "taxReportable": false,
                "category": "services",
                "processedAt": "2023-03-02T01:45:06.270Z",
                "forceUsTaxActivity": false,
                "taxWithholdingReason": null,
                "equivalentUntaxedAmount": {
                    "value": "10.00",
                    "currency": "USD"
                },
                "modifiedSinceCreation": false,
                "taxPaidByWithholdingAgents": "0",
                "status": "processed",
                "enteredAmount": {
                    "value": "10.00",
                    "currency": "USD"
                },
                "updatedAt": "2023-03-02T01:45:06.270Z",
                "createdAt": "2023-03-02T01:45:06.270Z",
                "deletedAt": null
            }
        },
        "rawHeaders": [
            "Date",
            "Thu, 02 Mar 2023 01:45:06 GMT",
            "Content-Type",
            "application/json; charset=utf-8",
            "Content-Length",
            "1255",
            "Connection",
            "close",
            "Cache-Control",
            "no-store, no-cache",
            "Content-Security-Policy",
            "default-src 'self';base-uri 'self';block-all-mixed-content;font-src 'self' https: data:;frame-ancestors 'self';img-src 'self' data:;object-src 'none';script-src 'self';script-src-attr 'none';style-src 'self' https: 'unsafe-inline';upgrade-insecure-requests",
            "X-DNS-Prefetch-Control",
            "off",
            "Expect-CT",
            "max-age=0",
            "Strict-Transport-Security",
            "max-age=15552000; includeSubDomains",
            "X-Download-Options",
            "noopen",
            "X-Content-Type-Options",
            "nosniff",
            "X-Permitted-Cross-Domain-Policies",
            "none",
            "Referrer-Policy",
            "no-referrer",
            "X-XSS-Protection",
            "0",
            "Access-Control-Allow-Origin",
            "*",
            "X-Rate-Limit-Limit",
            "75",
            "X-Rate-Limit-Remaining",
            "73",
            "X-Rate-Limit-Reset",
            "1677721565",
            "Vary",
            "Origin",
            "ETag",
            "W/\"4e7-BAny46qPSTlBK5uU9j7X+2j5hHQ\""
        ],
        "responseIsBinary": false
    },
    {
        "scope": "https://api.trolley.com:443",
        "method": "PATCH",
        "path": "/v1/recipients/R-DPo9qWkicF6AMJF1SNv4J5/offlinePayments/OP-UqKJ3sPjSDipGKKHM79EcU",
        "body": {
            "taxReportable": true,
            "amount": "10.00",
            "currency": "USD",
            "withholdingAmount": "2.40",
            "withholdingCurrency": "USD"
        },
        "status": 200,
        "response": {
            "ok": true,
            "offlinePayment": {
                "id": "OP-UqKJ3sPjSDipGKKHM79EcU",
                "recipientId": "R-DPo9qWkicF6AMJF1SNv4J5",
                "taxFormId": null,
                "entered": {
                    "value": "10.00",
                    "currency": "USD"
                },
                "withholding": {
                    "value": "2.40",
                    "currency": "USD"
                },
                "equivalentWithholding": {
                    "value": "2.40",
                    "currency": "USD"
                },
                "amount": "10.00",
                "currency": "USD",
                "withholdingAmount": "2.40",
                "withholdingCurrency": "USD",
                "equivalentWithholdingAmount": "2.40",
                "equivalentWithholdingCurrency": "USD",
                "paymentId": null,
                "externalId": "testOfflinePayment",
                "memo": "",
                "payoutMethod": null,
                "tags": [],
                "taxReportable": true,
                "category": "services",
                "processedAt": "2023-03-02T01:45:06.270Z",
                "forceUsTaxActivity": false,
                "taxWithholdingReason": null,
                "equivalentUntaxedAmount": {
                    "value": "10.00",
                    "currency": "USD"
                },
                "modifiedSinceCreation": true,
                "taxPaidByWithholdingAgents": "0",
                "status": "processed",
                "enteredAmount": {
                    "value": "10.00",
                    "currency": "USD"
                },
                "updatedAt": "2023-03-02T01:45:06.718Z",
                "createdAt": "2023-03-02T01:45:06.270Z",
                "deletedAt": null
            }
        },
        "rawHeaders": [
            "Date",
            "Thu, 02 Mar 2023 01:45:06 GMT",
            "Content-Type",
            "application/json; charset=utf-8",
            "Content-Length",
            "1253",
            "Connection",
            "close",
            "Cache-Control",
            "no-store, no-cache",
            "Content-Security-Policy",
            "default-src 'self';base-uri 'self';block-all-mixed-content;font-src 'self' https: data:;frame-ancestors 'self';img-src 'self' data:;object-src 'none';script-src 'self';script-src-attr 'none';style-src 'self' https: 'unsafe-inline';upgrade-insecure-requests",
            "X-DNS-Prefetch-Control",
            "off",
            "Expect-CT",
            "max-age=0",
            "Strict-Transport-Security",
            "max-age=15552000; includeSubDomains",
            "X-Download-Options",
            "noopen",
            "X-Content-Type-Options",
            "nosniff",
            "X-Permitted-Cross-Domain-Policies",
            "none",
            "Referrer-Policy",
            "no-referrer",
            "X-XSS-Protection",
            "0",
            "Access-Control-Allow-Origin",
            "*",
            "X-Rate-Limit-Limit",
            "75",
            "X-Rate-Limit-Remaining",
            "72",
            "X-Rate-Limit-Reset",
            "1677721565",
            "Vary",
            "Origin",
            "ETag",
            "W/\"4e5-f7oyEWS1KSz70djN6VZupVm86Ok\""
        ],
        "responseIsBinary": false
    }
]